tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'thoughtbot/formulae'
tap 'neovim/neovim'
# tap 'ethereum/ethereum'

brew 'rcm'
brew 'mas'

brew 'elixir'
brew 'flow'

brew 'git'
brew 'git-extras'
brew 'hub'
brew 'tmux'
brew 'ctags'
brew 'graphviz'
brew 'ripgrep'
brew 'mosh'
brew 'asciinema'
brew 'coreutils'
brew 'gpg'
# brew 'ethereum'

brew 'zsh'

brew 'the_silver_searcher'
brew 'fzf'

brew 'neovim'
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-perl', 'with-python3', 'with-ruby']

brew 'htop'
brew 'httpie'
brew 'jq'
brew 'jid'
brew 'cheat'
brew 'sshrc'

brew 'wget'

brew 'postgresql'
brew 'redis'
brew 'mysql'
brew 'sqlite'
# brew 'mongodb'

# brew 'purescript'
# brew 'haskell-stack'

# brew 'gcc'

brew 'rvm'
brew 'npm'

brew 'kubectl'
brew 'leiningen'
brew 'nginx'

# brew 'weechat', args: ['with-python', 'with-perl']

cask 'iterm2'

cask 'docker'
cask 'kitematic'

cask 'dropbox'
# cask 'transmission'

cask 'flux'
cask 'gyazo'
cask 'dash'

cask 'emacs'
# cask 'visual-studio-code'
# cask 'lighttable'
# cask 'intellij-idea-ce'

cask 'skype'
cask 'teamviewer'

cask 'vlc'
cask 'tunnelblick'
cask 'gpgtools'
cask 'keybase'

cask 'pgadmin3'

cask 'google-chrome'

# quick look plugins
# https://github.com/sindresorhus/quick-look-plugins

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# fonts

cask 'font-inconsolata'
cask 'font-vollkorn'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'

# apps from appstore

# mas 'Xcode', id: 497799835
mas 'Helium', id: 1054607607
mas 'Noizio', id: 928871589
mas 'Monosnap', id: 540348655
