tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'thoughtbot/formulae'

brew 'coreutils'
brew 'ctags'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'gpg'
brew 'htop'
brew 'jq'
brew 'neovim'
brew 'svn' # needed for the fonts down below
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tmux'
# brew 'vim', args: ['with-lua', 'with-perl', 'with-python3', 'with-ruby']
brew 'wget'
brew 'zsh'
brew 'fd'
brew 'tig'

# cask 'iterm2'
cask 'dropbox'
cask 'emacs'
cask 'visual-studio-code'

# cask 'vlc'
# cask 'gpgtools'
# cask 'keybase'

# quick look plugins
# https://github.com/sindresorhus/quick-look-plugins

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
# cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# fonts

cask 'font-inconsolata'
cask 'font-vollkorn'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'
